# =============================================================================
# TAPS
# =============================================================================

tap "hashicorp/tap"

# =============================================================================
# CORE SYSTEM LIBRARIES
# =============================================================================

brew "ca-certificates"
brew "openssl"
brew "readline"
brew "libffi"
brew "libgcrypt"
brew "libmagic"
brew "libusb"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "gmp"
brew "gnutls"
brew "pcre2"

# =============================================================================
# GNU COREUTILS & FINDUTILS
# =============================================================================

brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "gzip"

# =============================================================================
# BUILD TOOLS & COMPILERS
# =============================================================================

brew "autoconf"
brew "automake"
brew "cmake"
brew "gcc"
brew "pkg-config"

# =============================================================================
# PROGRAMMING LANGUAGES & RUNTIMES
# =============================================================================

brew "coq"
brew "deno"
brew "fnm"
brew "golang"
brew "mise"
brew "python"
brew "rbenv"

# =============================================================================
# PYTHON TOOLS
# =============================================================================

brew "pipx"
brew "ruff"
brew "uv"

# =============================================================================
# SHELL & TERMINAL
# =============================================================================

brew "bash"
brew "direnv"
brew "nushell"
brew "tmux"
brew "ttyrec"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# =============================================================================
# GIT & VERSION CONTROL
# =============================================================================

brew "fossil"
brew "git"
brew "git-delta"
brew "git-gui"

# =============================================================================
# MODERN CLI REPLACEMENTS
# =============================================================================

brew "bat"
brew "code-minimap"
brew "difftastic"
brew "duf"
brew "dust"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "htop"
brew "hyperfine"
brew "lsd"
brew "ripgrep"
brew "sd"

# =============================================================================
# NETWORKING & SSH
# =============================================================================

brew "aircrack-ng"
brew "aria2"
brew "autossh"
brew "curl"
brew "inetutils"
brew "iperf"
brew "iperf3"
brew "mosh"
brew "netcat"
brew "nmap"
brew "openssh"
brew "telnet"
brew "wget"
brew "wireguard-tools"

# =============================================================================
# AWS & CLOUD
# =============================================================================

brew "aiven-client"
brew "aws-cdk"
brew "awscli"
brew "s5cmd"
cask "gcloud-cli"
cask "session-manager-plugin"

# =============================================================================
# INFRASTRUCTURE AS CODE
# =============================================================================

brew "hashicorp/tap/packer"
brew "opentofu"
brew "terraform-cleaner"
brew "terraform-docs"
brew "terraform-iam-policy-validator"
brew "terraform-lsp"
brew "terraform-mcp-server"
brew "terragrunt"

# =============================================================================
# CONTAINERS & VIRTUALIZATION
# =============================================================================

brew "docker"
brew "docker-buildx"
brew "docker-credential-helper"

# =============================================================================
# DATABASES
# =============================================================================

brew "libpq"
system "brew", "link", "--force", "libpq"
brew "mysql-client"
brew "postgresql@16"
brew "redis"
brew "sqlite"

# =============================================================================
# BACKUP & ARCHIVING
# =============================================================================

brew "borgbackup"

# =============================================================================
# MEDIA & GRAPHICS
# =============================================================================

brew "exiftool"
brew "ffmpeg"
brew "fontforge"
brew "graphviz"
brew "imagemagick"
brew "media-info"
brew "mkvtoolnix"
brew "mplayer"
brew "yt-dlp"

# =============================================================================
# MISC CLI TOOLS
# =============================================================================

brew "backlog-md"
brew "biome"
brew "geckodriver"
brew "gnupg"
brew "go-task"
brew "mkcert"
brew "p7zip"
brew "pv"
brew "pwgen"
brew "rsync"
brew "shfmt"
brew "stockfish"
brew "verilator"
brew "vim"
brew "watch"

# =============================================================================
# CASKS - PRODUCTIVITY
# =============================================================================

cask "anki"
cask "clocker"
cask "libreoffice"
cask "obsidian"
cask "raycast"

# =============================================================================
# CASKS - DEVELOPMENT
# =============================================================================

cask "base"
cask "claude-code"
cask "ghostty"
cask "orbstack"
cask "postico"
cask "rstudio"

# =============================================================================
# CASKS - BROWSERS
# =============================================================================

cask "google-chrome"

# =============================================================================
# CASKS - MEDIA
# =============================================================================

cask "obs"
cask "qbittorrent"
cask "streamlabs"
cask "vlc"

# =============================================================================
# CASKS - COMMUNICATION
# =============================================================================

cask "whatsapp"

# =============================================================================
# CASKS - GIS & MAPPING
# =============================================================================

cask "qgis"

# =============================================================================
# CASKS - SYSTEM UTILITIES
# =============================================================================

cask "disk-inventory-x"
cask "grandperspective"
cask "jiggler"
cask "lulu"
cask "taskexplorer"
cask "wireshark-app"
cask "xquartz"

# =============================================================================
# CASKS - SECURITY
# =============================================================================

cask "gpg-suite"

# =============================================================================
# CASKS - FONTS
# =============================================================================

cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
