tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/services"

# brew "antlr"
# brew "bazel"
# brew "direnv"
# brew "gdal"
# brew "git-lfs"
# brew "gping"
# brew "httpie"
# brew "mplayer"
# brew "tor", restart_service: true
# brew "trippy"
# brew "webp"
brew "aircrack-ng"
brew "aria2"
brew "autoconf"
brew "automake"
brew "autossh"
brew "bat"
brew "borgbackup"
brew "ca-certificates"
brew "cmake"
brew "coq"
brew "coreutils"
brew "curl"
brew "difftastic"
brew "duf"
brew "dust"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fnm"
brew "fontforge"
brew "fossil"
brew "fzf"
brew "gawk"
brew "gcc"
brew "geckodriver"
brew "git"
brew "git-delta"
brew "git-gui"
brew "gmp"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "golang"
brew "graphviz"
brew "grep"
brew "gzip"
brew "htop"
brew "imagemagick"
brew "iperf"
brew "iperf3"
brew "libgcrypt"
brew "libmagic"
brew "libusb"
brew "lsd"
brew "mosh"
brew "neofetch"
brew "netcat"
brew "nmap"
brew "nu"
brew "openssh"
brew "openssl"
brew "p7zip"
brew "pcre"
brew "pipx"
brew "postgresql@16"
brew "pv"
brew "pwgen"
brew "python"
brew "readline"
brew "ripgrep"
brew "rsync"
brew "sd"
brew "shfmt"
brew "telnet"
brew "tldr"
brew "tmux"
brew "ttyrec"
brew "uv"
brew "vim"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zsh"


# cask "binary-ninja"
# cask "coqide"
# cask "cubicsdr"
# cask "ghidra"
# cask "google-chrome"
cask "BetterDisplay"
cask "audacity"
cask "blockblock"
cask "chromedriver"
cask "clocker"
cask "disk-inventory-x"
cask "eloston-chromium"
cask "gimp"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "jiggler"
cask "karabiner-elements"
cask "knockknock"
cask "lunar"
cask "mactex"
cask "musescore"
cask "orion"
cask "postico"
cask "qbittorrent"
cask "qgis@ltr"
cask "r"
cask "raycast"
cask "rstudio"
cask "sonic-visualiser"
cask "texshop"
cask "utm"
cask "vlc"
cask "waterfox"
cask "whatsapp"
cask "wireshark"
cask "xquartz"
